app/controllers/videos_controller.rb

  def index
    @videos = Video.all
    @categories = Category.all
---
SELECT "videos".* FROM "videos"
SELECT "categories".* FROM "categories"

  def create
    @video = Video.new(params[:video])

    if @video.save
---
INSERT INTO "videos" ("author", "created_at", "description", "duration", "rate", "title", "updated_at", "upload_date", "url") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def edit
     @video = Video.find(params[:id])
---
SELECT "videos".* FROM "videos" WHERE "videos"."id" = ? LIMIT 1  [["id", "1"]]

  def update
    @video = Video.find(params[:id])

    respond_to do |format|
      if @video.update_attributes(params[:video])
---
SELECT "videos".* FROM "videos" WHERE "videos"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "videos" SET "url" = 'http://www.youtube.com/embed/eXZv0tbqTOI', "author" = '', "updated_at" = '2012-10-16 03:20:22.661511' WHERE "videos"."id" = 1